// 플레이어 위치 및 크기
let px, py;
let pd = 57;

// 적 이동 상태 및 방향
let isMoving = false;
let dir = "RIGHT";
let eSpeed = 10;

// 적 위치 배열
let ex = [500, 1000, 1500, 2000, 2500, 800, 1200, 1800, 2200];
let ey = [500, 1000, 500, 1000, 500, 300, 700, 300, 700];

// 콩 위치 배열
let dx = [100, 200, 300, 400, 500];
let dy = [150, 250, 100, 300, 200];

// 콩 크기 및 활성 상태 배열
let dSize = 30;
let dActive = [true, true, true, true, true];
let activeDotsCount = 0;

// 실시간 정보 표기 설정
let score = 0;
let energy = 3;
let gameOver = false;
let gameWin = false;

// 벽 충돌 시스템
// 플레이어 공간
let zones = [
  {x: 355,  y: 50,  w: 2106, h: 1386},
  {x: -100,    y: 668, w: 655,  h: 152},
  {x: 2261, y: 668, w: 655,  h: 152},
];

// 안전 구역 정의 (플레이어가 안전하게 이동할 수 있는 영역)
let safeZones = [
  {x: 370,  y: 65,   w: 400,  h: 80},
  {x: 640,  y: 65,   w: 130,  h: 280},
  {x: 1050, y: 65,   w: 270,  h: 280},
  {x: 1470, y: 65,   w: 270,  h: 280},
  {x: 1700, y: 65,   w: 130,  h: 280},
  {x: 1870, y: 65,   w: 400,  h: 80},
  {x: 370,  y: 350,  w: 390,  h: 150},
  {x: 2060, y: 350,  w: 390,  h: 150},
  {x: 370,  y: 540,  w: 180,  h: 120},
  {x: 1660, y: 540,  w: 180,  h: 120},
  {x: 20,   y: 675,  w: 520,  h: 130},
  {x: 2270, y: 675,  w: 520,  h: 130},
  {x: 370,  y: 830,  w: 180,  h: 120},
  {x: 1660, y: 830,  w: 180,  h: 120},
  {x: 370,  y: 980,  w: 290,  h: 180},
  {x: 760,  y: 980,  w: 380,  h: 180},
  {x: 1680, y: 980,  w: 290,  h: 180},
  {x: 2020, y: 980,  w: 390,  h: 180},
  {x: 370,  y: 1200, w: 500,  h: 150},
  {x: 1900, y: 1200, w: 500,  h: 150},
];

// 벽 정의 (플레이어가 충돌하는 영역)
let walls = [
  {x: 1870, y: 668,  w: 130, h: 175}, // 오른쪽 중앙 사각형 아래
  {x: 1828, y: 668,  w: 40,  h: 175}, // 오른쪽 중앙 사각형 위
  {x: 920,  y: 668,  w: 40,  h: 175}, // 왼쪽 중앙 사각형 위
  {x: 788,  y: 668,  w: 130, h: 175}, // 왼쪽 중앙 사각형 아래
  {x: 1080, y: 900,  w: 40,  h: 160}, // 십자가 왼쪽 아래
  {x: 1700, y: 900,  w: 40,  h: 160}, // 십자가 오른쪽 아래
  {x: 700,  y: 1000, w: 250, h: 40}, // 중앙 가로 양쪽 사각형 왼쪽
  {x: 1866, y: 1000, w: 250, h: 40}, // 중앙 가로 양쪽 사각형 오른쪽
  {x: 950,  y: 1200, w: 295, h: 30}, // 하단 긴 가로 양쪽 사각형 왼쪽
  {x: 1560, y: 1200, w: 295, h: 30}, // 하단 긴 가로 양쪽 사각형 오른쪽
  {x: 490,  y: 1080, w: 40,  h: 130}, // 하단 짧은 세로 양쪽 사각형 왼쪽
  {x: 2290, y: 1080, w: 40,  h: 130}, // 하단 짧은 세로 양쪽 사각형 오른쪽
  {x: 780,  y: 160,  w: 480, h: 100}, // 상단 양쪽 긴 사각형 왼쪽
  {x: 1560, y: 160,  w: 480, h: 100}, // 상단 양쪽 긴 사각형 오른쪽
  {x: 2180, y: 160,  w: 150, h: 100}, // 상단 양쪽 짧은 사각형 오른쪽
  {x: 486,  y: 160,  w: 150, h: 100}, // 상단 양쪽 짧은 사각형 왼쪽
  {x: 486,  y: 355,  w: 150, h: 40}, // 상단 양쪽 작고 긴 사각형 왼쪽
  {x: 2180, y: 355,  w: 150, h: 40}, // 상단 양쪽 작고 긴 사각형 오른쪽
  {x: 770,  y: 1280, w: 100, h: 30}, // 하단 양쪽 작은 사각형 왼쪽
  {x: 1890, y: 1280, w: 100, h: 30}, // 하단 양쪽 작은 사각형 오른쪽
  {x: 300,  y: 540,  w: 250, h: 120}, // 상단 양쪽 긴 사각형 왼쪽 아래
  {x: 300,  y: 830,  w: 250, h: 130}, // 상단 양쪽 긴 사각형 왼쪽 위
  {x: 2270, y: 540,  w: 250, h: 120}, // 상단 양쪽 긴 사각형 오른쪽 아래
  {x: 2270, y: 830,  w: 250, h: 130}, // 상단 양쪽 긴 사각형 오른쪽 위
  {x: 1401, y: 55,   w: 30,  h: 190}, // 중앙 상단 사각 공간
  {x: 1230, y: 410,  w: 360, h: 20}, // 중앙 위 T자 공간 상단
  {x: 1377, y: 440,  w: 70,  h: 80}, // 중앙 위 T자 공간 중간
  {x: 1230, y: 1010, w: 360, h: 20}, // 중앙 밑 T자 공간 상단
  {x: 1405, y: 1034, w: 10,  h: 100}, // 중앙 밑 T자 공간 중간
  {x: 1230, y: 1270, w: 360, h: 20}, // 중앙 밑 T자 공간 하단
  {x: 1405, y: 1290, w: 10,  h: 100}, // 중앙 밑 T자 공간 중간
  {x: 1230, y: 680,  w: 360, h: 180}, // 중앙 사각 공간
  {x: 792,  y: 400,  w: 60,  h: 90}, // 상단 왼쪽 r
  {x: 792,  y: 370,  w: 190, h: 20}, // 상단 왼쪽 r
  {x: 1985, y: 400,  w: 60,  h: 90}, // 상단 오른쪽 ㄱ
  {x: 1855, y: 370,  w: 190, h: 20}, // 상단 오른쪽 ㄱ
  {x: 956,  y: 520,  w: 300, h: 30}, // 십자가 왼쪽
  {x: 1110, y: 370,  w: 30,  h: 320}, // 십자가 왼쪽
  {x: 1596, y: 520,  w: 300, h: 30}, // 십자가 오른쪽
  {x: 1710, y: 370,  w: 30,  h: 320}, // 십자가 오른쪽
  {x: 640,  y: 1130, w: 83,  h: 230}, // 왼쪽 통로
  {x: 500,  y: 1355, w: 740, h: 20}, // 왼쪽 통로
  {x: 1093, y: 1291, w: 20,  h: 70}, // 왼쪽 통로
  {x: 2030, y: 1130, w: 143, h: 230}, // 오른쪽 통로
  {x: 1580, y: 1355, w: 700, h: 20}, // 오른쪽 통로
  {x: 1710, y: 1290, w: 20,  h: 70}, // 오른쪽 통로
];

function setup() {
  createCanvas(2816, 1536); //해상도 크기 조절
  // 초기 플레이어 위치 설정
  px = 400;
  py = 300;

  // 아이템(콩)배치 (맵 구석까지 가는 규칙 배열)
  dx = [430, 1420, 1790, 1200, 2400];
  dy = [200, 340, 700, 1100, 1200];
}

// 벽 충돌 체크 함수
function isHittingWall(nx, ny) {
  let r = pd / 2;

  let inZone = false;
  for (let z of zones) { // 안전 구역 내에 있는지 체크
    if (nx - r > z.x && nx + r < z.x + z.w && // 플레이어의 왼쪽과 오른쪽이 구역의 왼쪽과 오른쪽 사이에 있는지
        ny - r > z.y && ny + r < z.y + z.h) { 
      inZone = true;
      break;
    }
  }

  if (!inZone) return true; // 안전 구역 밖이면 벽에 부딪힌 것으로 간주

  for (let w of walls) { // 벽과 충돌하는지 체크
    if (nx + r > w.x && nx - r < w.x + w.w && // 플레이어의 왼쪽과 오른쪽이 벽의 왼쪽과 오른쪽 사이에 있는지
        ny + r > w.y && ny - r < w.y + w.h) { 
      return true;
    }
  }
  return false;
}

function draw() {
  background(0);
  drawMap();

  isMoving = false;
  activeDotsCount = 0;

  // 플레이어 키보드 컨트롤
  if (!gameOver && !gameWin) {
    if (keyIsDown(LEFT_ARROW))  { if (!isHittingWall(px - 1, py)) px -= 1; isMoving = true; dir = "LEFT"; }
    if (keyIsDown(RIGHT_ARROW)) { if (!isHittingWall(px + 1, py)) px += 1; isMoving = true; dir = "RIGHT"; }
    if (keyIsDown(UP_ARROW))    { if (!isHittingWall(px, py - 1)) py -= 1; isMoving = true; dir = "UP"; }
    if (keyIsDown(DOWN_ARROW))  { if (!isHittingWall(px, py + 1)) py += 1; isMoving = true; dir = "DOWN"; }

    // 적 이동 및 충돌 체크
    for (let i = 0; i < 5 + floor(score / 10); i++) {
      fill(0, 0, 255);
      noStroke();
      rect(ex[i], ey[i], 40, 40);
      ex[i] += random(-eSpeed, eSpeed);
      ey[i] += random(-eSpeed, eSpeed);

      let d = dist(px, py, ex[i], ey[i]);
      if (d < (pd + 40) / 2) {
        energy--;
        ex[i] = random(200, 2500);
        ey[i] = random(200, 1200);
        if (energy <= 0) gameOver = true;
      }
    }
  }

  // 애니메이션 효과: 플레이어가 이동 중일 때 입을 벌리는 효과
  fill(255, 255, 0);
  noStroke();
  if (isMoving) {
    if (dir == "RIGHT")     arc(px, py, pd, pd, 0.5, TWO_PI - 0.5); // pi로 입 벌리는 효과, 0.5는 입 벌리는 정도 조절
    else if (dir == "LEFT") arc(px, py, pd, pd, PI + 0.5, PI - 0.5); 
    else if (dir == "UP")   arc(px, py, pd, pd, -HALF_PI + 0.5, -HALF_PI - 0.5);
    else if (dir == "DOWN") arc(px, py, pd, pd, HALF_PI + 0.5, HALF_PI - 0.5);
  } else {
    ellipse(px, py, pd);
  }

  // 플레이어 이동 처리 (벽 충돌 체크 포함)
  if (keyIsDown(LEFT_ARROW)) {
    if (!isHittingWall(px - 4, py)) px -= 4;
    isMoving = true; dir = "LEFT";
    } 

  if (keyIsDown(RIGHT_ARROW)) {
    if (!isHittingWall(px + 4, py)) px += 4;
    isMoving = true; dir = "RIGHT";
  }

  if (keyIsDown(UP_ARROW)) {
    if (!isHittingWall(px, py - 4)) py -= 4;
    isMoving = true; dir = "UP";
  }

  if (keyIsDown(DOWN_ARROW)) {
    if (!isHittingWall(px, py + 4)) py += 4;
    isMoving = true; dir = "DOWN";
  }

  // 화면 워프 로직: 맵의 양쪽 통로에서 화면을 넘어가면 반대편으로 이동
  if (py > 668 && py < 820) {
    if (px < -50 ) px = 2800;
    if (px > 2866) px = 16;
  }

  // 아이템 습득 및 점수 계산, 난이도 조절: 점수 높아지면 적 수 증가
  for (let i = 0; i < 5 + floor(score / 10); i++) {
    if (dActive[i]) {
      fill(255, 0, 0);
      noStroke();
      ellipse(dx[i], dy[i], dSize);
      activeDotsCount++;
      let d = dist(px, py, dx[i], dy[i]);
      if (d < (pd + dSize) / 2) {
        dActive[i] = false;
        score += 10;
      }
    }
  }

  // 게임 승리 조건 체크
  if (activeDotsCount == 0) gameWin = true;

  // 실시간 정보 표기
  fill(255);
  noStroke();
  textAlign(LEFT, TOP);
  textSize(70);
  text("점수: " + score, 20, 80);
  text("에너지: " + energy, 20, 180);

  // 게임 오버 표시
  if (gameOver) {
    fill(255, 0, 0);
    textSize(120);
    textAlign(CENTER);
    text("GAME OVER", width / 2, height / 2);
    textSize(60);
    text("R키를 누르세요", width / 2, height / 2 + 100);
  }

  // 게임 승리 표시
  if (gameWin) {
    fill(0, 255, 0);
    textSize(120);
    textAlign(CENTER);
    text("YOU WIN!", width / 2, height / 2);
    textSize(60);
    text("R키를 누르세요", width / 2, height / 2 + 100);
  }

  // 초기화 및 리스타트 일부분, 게임 오버 또는 승리 상태에서 R키를 누르면 게임이 초기화되고 다시 시작
  if (keyIsPressed && key == 'r') resetGame();
}

// 게임 초기화 함수: 플레이어 위치, 점수, 에너지, 게임 상태, 방향 등을 초기값으로 설정하고 콩을 다시 활성화
function resetGame() {
  px = 400;
  py = 300;
  score = 0;
  energy = 3;
  gameOver = false;
  gameWin = false;
  dir = "RIGHT";
  randomizeDots();
}

// 맵 그리기 함수: 맵의 배경, 벽, 안전 구역 등을 그리기
function drawMap() {
    noStroke();
    fill(0, 5, 65);
    rect(355, 50, 2106, 1386);
    
    rect (0, 688, 555, 152);
    rect(2261, 668, 555, 152);


    fill(0);
    stroke(0, 200, 255);
    strokeWeight(9);

    // 외곽 상단
    line(355, 50, 2461, 50);
    
    // 왼쪽 상단 ㄴ자 공간
    line(355, 50, 355, 528);
    line(355, 528, 555, 528);

    // 오른쪽 상단 ㄴ자 공간
    line(2461, 50, 2461, 528);
    line(2461, 528, 2261, 528);

    // 통로 상단 이음 벽
    line(555, 528, 555, 668); 
    line(2261, 528, 2261, 668);

    // 왼쪽 통로
    line(0, 820, 555, 820);
    line(0, 668, 555, 668);

    // 오른쪽 통로
    line(2261, 820, 2816, 820);
    line(2261, 668, 2816, 668);

    // 외관 하단
    line(355, 1436, 2461, 1436);
  
    // 왼쪽 하단 ㄴ자 공간
    line(555, 968, 355, 968);
    line(355, 1436, 355, 968);
  
    // 오른쪽 하단 ㄴ자 공간
    line(2461, 1436, 2461, 968);
    line(2461, 968, 2261, 968);

    // 통로 하단 이음 벽
    line(555, 968, 555, 820);
    line(2261, 968, 2261, 820);


    // 중앙 사각 공간
    line(1218, 868, 1598, 868);
    line(1218, 668, 1218, 868);
    line(1598, 668, 1598, 868);
    line(1218, 668, 1345, 668);
    line(1471, 668, 1598, 668);

    // 중앙 위 T자 공간
    line(1218, 400, 1598, 400);
    line(1598, 400, 1598, 440);
    line(1218, 400, 1218, 440);
    line(1218, 440, 1365, 440);
    line(1451, 440, 1598, 440);
    line(1365, 440, 1365, 530);
    line(1451, 440, 1451, 530);
    line(1365, 530, 1451, 530);

    // 중앙 밑 T자
    line(1218, 1000, 1598, 1000);
    line(1598, 1000, 1598, 1040);
    line(1218, 1000, 1218, 1040);
    
    line(1218, 1040, 1393, 1040);
    line(1423, 1040, 1598, 1040);

    line(1393, 1040, 1393, 1140);
    line(1423, 1040, 1423, 1140);
    line(1393, 1140, 1423, 1140);
    
    // 중앙 밑 T자 
    line(1218, 1260, 1598, 1260);
    line(1598, 1260, 1598, 1300);
    line(1218, 1260, 1218, 1300);

    line(1218, 1300, 1393, 1300);
    line(1423, 1300, 1598, 1300);

    line(1393, 1300, 1393, 1400);
    line(1423, 1300, 1423, 1400);
    line(1393, 1400, 1423, 1400);

    // 상단 왼쪽 r
    line(786, 360, 986, 360);
    line(786, 360, 786, 500);
    line(986, 360, 986, 400);
    line(986, 400, 860, 400);
    line(860, 400, 860, 500);
    line(860, 500, 786, 500);

    // 상단 오른쪽 ㄱ
    line(2050, 360, 1850, 360);
    line(2050, 360, 2050, 500);
    line(1850, 360, 1850, 400);
    line(1850, 400, 1976, 400);
    line(1976, 400, 1976, 500);
    line(1976, 500, 2050, 500);

    //십자가 왼쪽
    line(1150, 360, 1100, 360);
    line(1150, 360, 1150, 510);
    line(1150, 510, 1260, 510);
    line(1260, 520, 1260, 560);
    line(1260, 560, 1150, 560);
    line(1150, 560, 1150, 700);
    line(1150, 700, 1100, 700);
    line(1100, 700, 1100, 560);
    line(1100, 560, 950, 560);
    line(950, 560, 950, 510);
    line(950, 510, 1100, 510);
    line(1100, 510, 1100, 360);
    
    // 십자가 오른쪽
    line(1700, 360, 1750, 360);
    line(1700, 360, 1700, 510);
    line(1700, 510, 1590, 510);
    line(1590, 520, 1590, 560);
    line(1590, 560, 1700, 560);
    line(1700, 560, 1700, 700);
    line(1700, 700, 1750, 700);
    line(1750, 700, 1750, 560);
    line(1750, 560, 1900, 560);
    line(1900, 560, 1900, 510);
    line(1900, 510, 1750, 510);
    line(1750, 510, 1750, 360);
    
    // 중앙 상단 사각 공간
    line(1388, 50, 1388, 250);
    line(1438, 50, 1438, 250);
    line(1388, 250, 1438, 250);

    // 양쪽 중앙 사각 (오른쪽)
    rect(1870, 668, 130, 175);
    rect(1828, 668, 40, 175);

    // 양쪽 중앙 사각 (왼쪽)
    rect(920, 668, 40, 175);
    rect(788, 668, 130, 175);

    // 십자가 밑 사각 (정사각형)
    rect(1080, 900, 40, 160);
    rect(1700, 900, 40, 160);

    // 중앙 가로 양쪽 사각형
    rect (700, 1000, 250, 40);
    rect (1866, 1000, 250, 40);

    // 하단 긴 가로 양쪽 사각형
    rect (950, 1200, 295, 30);
    rect (1560, 1200, 295, 30);

    // 하단 짧은 세로 양쪽 사각형
    rect (490, 1080, 40, 130);
    rect (2290, 1080, 40, 130);

    // 상단 양쪽 긴 사각형
    rect(780, 160, 480, 100);
    rect(1560, 160, 480, 100);

    // 상단 양쪽 짧은 사각형 
    rect(2180, 160, 150, 100);
    rect(486, 160, 150, 100);

    // 상단 양쪽 작고 긴 사각형
    rect (486, 355, 150, 40);
    rect (2180, 355, 150, 40);

    // 하단 양쪽 작은 사각형
    rect(770, 1280, 100, 30);
    rect(1890, 1280, 100, 30);

    // 밑 뾰족 두 개 (왼쪽)
    line(1080, 1280, 1120, 1280);
    line(1080, 1280, 1080, 1350);
    line(1120, 1280, 1120, 1350);

    line(1120, 1350, 1250, 1350);
    line(1250, 1350, 1250, 1380);

    line(490, 1380, 1250, 1380);
    line(490, 1380, 490, 1350);
    line(490, 1350, 630, 1350);

    line(630, 1350, 630, 1120);
    line(630, 1120, 800, 1120)

    line(800, 1120, 800, 1140);
    line(800, 1140, 730, 1140);

    line(730, 1140, 730, 1350);
    line(730, 1350, 1080, 1350);


    // 밑 뾰족 두 개 (오른쪽)
    line(1700, 1280, 1740, 1280);
    line(1700, 1280, 1700, 1350);
    line(1740, 1350, 1740, 1280);

    line(1700, 1350, 1570, 1350);
    line(1570, 1350, 1570, 1380);
    line(1570, 1380, 2290, 1380);
    line(2290, 1380, 2290, 1350);
    line(2290, 1350, 2180, 1350);

    line(2180, 1350, 2180, 1120);
    line(2180, 1120, 1950, 1120);

    line(1950, 1120, 1950, 1140);
    line(1950, 1140, 2020, 1140);

    line(2020, 1140, 2020, 1350);
    line(1740, 1350, 2020, 1350);
    
    // 배경색이 파란 색으로 칠해진 부분을 검정 사각형으로 덮음
    noStroke();
    fill(0, 0, 0);

    rect(300, 540, 250, 120);
    rect(300, 830, 250, 130);
    rect(2270,540, 250, 120);
    rect(2270, 830, 250, 130);

    rect(1401, 55, 30, 190);

    rect(1230, 410, 360, 20);
    rect(1377, 440, 70, 80);

    rect(1230, 1010, 360, 20);
    rect(1405, 1034, 10, 100);

    rect(1230, 1270, 360, 20);
    rect(1405, 1290, 10, 100);

    rect (1230, 680, 360, 180);

    rect (792, 400, 60, 90);
    rect (792, 370, 190, 20);

    rect (1985, 400, 60, 90);
    rect (1855, 370, 190, 20);

    rect (956, 520, 300, 30);
    rect (1110, 370, 30, 320);

    rect (1596, 520, 300, 30);
    rect (1710, 370, 30, 320);

    rect (640, 1130, 150, 5);
    rect (640, 1130, 83, 230);
    rect (500, 1355, 740, 20);
    rect (1093, 1291, 20, 70);

    rect (1960, 1130, 150, 5);
    rect (2030, 1130, 143, 230);
    rect (1580, 1355, 700, 20);
    rect (1710, 1290, 20, 70);
    
    
    }

    // 초기화 및 리스타트
    function resetGame() {
      px = 400;
      py = 300;
      score = 0;
      energy = 3;
      gameOver = false;
      gameWin = false;
      dir = "RIGHT";
      for(let i = 0; i < 5; i++) {
        dActive[i] = true;
      }
    };
    
